{
    "recipes": [
        {
            "id": "r0",
            "title": "Spaghetti alla carbonara",
            "rating": "4,5",
            "duration": "20",
            "shortDescription": "Simple and easy dish, made by coating pasta in a rich, creamy sauce of eggs, cheese, pork, and black pepper.",
            "description": "",
            "overviewImg": "",
            "yield": "4",
            "ingredients": [
                {
                    "name": "Dried spaghetti",
                    "quantity": "450",
                    "unit": "g"
                },
                {
                    "name": "Salt",
                    "quantity": "",
                    "unit": ""
                },
                {
                    "name": "Guanciale",
                    "quantity": "85",
                    "unit": "g"
                },
                {
                    "name": "Egg yolks",
                    "quantity": "8",
                    "unit": ""
                },
                {
                    "name": "Grated Pecorino",
                    "quantity": "25",
                    "unit": "g"
                },
                {
                    "name": "Grated Parmigiano",
                    "quantity": "25",
                    "unit": "g"
                },
                {
                    "name": "Black pepper",
                    "quantity": "",
                    "unit": ""
                }
            ],
            "directions": [
                {
                    "description": "Bring a pot of salted water to a boil. Add pasta and cook, stirring, until al dente.",
                    "image": ""
                },
                {
                    "description": "Put guanciale (or pancetta or bacon) in a large skillet and cook, stirring frequently, over medium heat, until fat has rendered and guanciale is crisp, about 7 minutes. In a large metal heatproof mixing bowl, whisk together whole eggs and yolks, Pecorino Romano, Parmigiano-Reggiano, and black pepper.",
                    "image": ""
                },
                {
                    "description": "Using tongs and/or a strainer, transfer pasta to skillet with crisped guanciale and its fat; be sure not to drain boiling pasta water. Add remaining 1 tablespoon (15ml) olive oil to pasta and stir to combine; let cool slightly. Scrape pasta, pork, and all the fat into the egg mixture. Measure 1/2 cup (120ml) pasta-cooking water and add to pasta and egg mixture. Stir well to combine.",
                    "image": ""
                },
                {
                    "description": "Set mixing bowl over pot of boiling pasta water (make sure bottom of bowl does not touch the water) and cook, stirring quickly with tongs, until sauce thickens to a creamy, silky consistency and leaves trails as you stir. Remove from heat, season with salt if needed, and divide into bowls. Serve right away, topping with more grated cheese and freshly ground pepper as desired.",
                    "image": ""
                }
            ],
            "helpWeyword": ""
        },
        {
            "id": "r1",
            "title": "",
            "rating": "",
            "duration": "",
            "shortDescription": "",
            "description": "",
            "overviewImg": "",
            "yield": "",
            "ingredients": [
                {
                    "name": "",
                    "quantity": "",
                    "unit": ""
                },
                {
                    "name": "",
                    "quantity": "",
                    "unit": ""
                }
            ],
            "directions": [
                {
                    "description": "",
                    "image": ""
                },
                {
                    "description": "",
                    "image": ""
                }
            ],
            "helpWeyword": ""
        }
    ]
}